const AgreementContents = {
  terms: `제1조 (목적)
  본 약관은 꾹모아 팀(이하 “회사”)이 제공하는 꾹모아 앱 및 관련 서비스(이하 “서비스”)의 이용과 관련하여, 회사와 이용자 간의 권리, 의무 및 책임사항을 규정함을 목적으로 합니다.
제2조 (용어의 정의)
 1. “서비스”란 회사가 운영하는 꾹모아 앱과 관련된 모든 기능 및 콘텐츠를 의미합니다.
 2. “회원”이란 본 약관에 동의하고 회사가 제공하는 서비스를 이용하는 자를 말합니다.
 3. “계정”이란 회원이 서비스 이용을 위해 등록한 로그인 정보를 말합니다.
제3조 (약관의 효력 및 변경)
 1. 본 약관은 회원이 동의함으로써 효력이 발생합니다.
 2. 회사는 관련 법령을 위반하지 않는 범위에서 약관을 변경할 수 있으며, 변경 시 공지사항을 통해 사전 고지합니다.
 3. 변경된 약관에 동의하지 않을 경우, 회원은 서비스 이용을 중단하고 탈퇴할 수 있습니다.
제4조 (회원가입)
 1. 회원은 회사가 정한 절차에 따라 회원가입을 신청해야 합니다.
 2. 회사는 다음 각 호에 해당하는 경우 가입을 거절할 수 있습니다.
  ① 타인의 명의로 신청한 경우
  ② 허위 정보를 기재한 경우
  ③ 기타 서비스 운영에 지장을 초래할 우려가 있는 경우
제5조 (회원의 의무)
 회원은 다음 행위를 해서는 안 됩니다.
 1. 타인의 개인정보 또는 계정을 도용하는 행위
 2. 불법 프로그램 사용, 서버 해킹 등 서비스 방해 행위
 3. 타인에게 불쾌감이나 피해를 주는 행위
 4. 관련 법령 및 본 약관을 위반하는 행위
제6조 (서비스의 제공 및 변경)
 1. 회사는 서비스 기획 및 운영상 필요한 경우, 서비스의 일부 또는 전부를 변경할 수 있습니다.
 2. 서비스 내용 변경 시 회원에게 사전 공지합니다.
제7조 (서비스의 중단)
 회사는 시스템 점검, 업데이트, 기술적 문제 등 불가피한 사유로 서비스 제공을 일시 중단할 수 있습니다.
제8조 (면책조항)
 회사는 천재지변, 통신장애 등 불가항력적 사유로 인한 손해에 대해 책임을 지지 않습니다.
[부칙]
 본 약관은 2025년 11월 4일부터 시행합니다.
`,

  privacy: `1. 수집 항목
  - (필수) 이름, 이메일, 비밀번호
  - (선택) 프로필 이미지, 관심 카테고리
2. 수집 목적
  - 회원 식별 및 로그인 관리
  - 서비스 제공 및 이용 통계 분석
  - 고객 문의 대응 및 공지사항 전달
3. 보유 및 이용 기간
  - 회원 탈퇴 시 즉시 파기
  - 단, 관계 법령(전자상거래법, 통신비밀보호법 등)에 따라 보관이 필요한 경우 해당 기간 동안 보관
4. 동의 거부권 및 불이익
  - 이용자는 개인정보 제공에 동의하지 않을 수 있습니다.
  - 단, 필수 항목 미동의 시 회원가입 및 서비스 이용이 제한됩니다.
[부칙]
  본 동의서는 2025년 11월 4일부터 적용됩니다.`,

  thirdParty: `1. 제공받는 자
  - 협력 서비스 운영사 및 제휴 파트너
2. 제공 항목
  - 이름, 이메일, 서비스 이용 내역
3. 제공 목적
  - 제휴 서비스 제공 및 맞춤형 추천 기능 운영
4. 보유 및 이용 기간
  - 제공일로부터 1년, 이후 즉시 파기
5. 동의 거부권
  - 이용자는 동의를 거부할 수 있으며, 거부 시 제휴 기능 이용이 제한될 수 있습니다.
[부칙]
  본 동의서는 2025년 11월 4일부터 적용됩니다.`,

  marketing: `1.이용 목적
  - 이벤트, 신규 서비스, 혜택 등 안내
  - 맞춤형 광고 및 프로모션 제공
2. 수집 항목
  - 이름, 이메일, 휴대전화번호
3. 보유 및 이용 기간
  - 동의 철회 시 또는 회원 탈퇴 시까지
4. 수신 거부
  - 회원은 언제든지 설정 > 알림 수신 설정 메뉴에서 마케팅 수신을 거부할 수 있습니다.
[부칙]
  본 동의서는 2025년 11월 4일부터 적용됩니다.`,
} as const;

export default AgreementContents;
